namespace TreesTester
{
	public class Tester
	{
		private static string path = @"D:\Документи\Навчання\ІФНТУНГ\2 Курс\1 Семестр\Алгоритми та структури даних\Лабраторні\Лабораторна 5 -\Тести.txt";

		public static void Test()
		{
			new NumberstUnit().Test("Створення дерева з чисел", path,
				"6590\t-7359\t4151\t4062\t4870\r\n-4560\t-3225\t1872\t8386\t-9683\r\n7877\t-3774\t8833\t-8225\t-1419\r\n-1797\t-7382\t-6034\t8574\t-259",
				"6590\t-7359\t4151\t4062\t4870\r\n-4560\t-3225\t1872\t8386\t-9683\r\n7877\t-3774\t8833\t-8225\t-1419\r\n-1797\t-7382\t-6034\t8574\t-259\r\n-509\t2050\t-1367\t7482\t-3511\r\n6928\t2893\t7457\t-8529\t-8890\r\n5483\t8730\t253\t4472\t-4973\r\n-9351\t-4337\t7020\t7965\t820",
				"6590\t-7359\t4151\t4062\t4870\r\n-4560\t-3225\t1872\t8386\t-9683\r\n7877\t-3774\t8833\t-8225\t-1419\r\n-1797\t-7382\t-6034\t8574\t-259\r\n-509\t2050\t-1367\t7482\t-3511\r\n6928\t2893\t7457\t-8529\t-8890\r\n5483\t8730\t253\t4472\t-4973\r\n-9351\t-4337\t7020\t7965\t820\r\n4184\t550\t6186\t-5470\t-6461\r\n8442\t-4881\t-3636\t-8961\t-1093\r\n-6701\t3232\t7894\t8589\t1358\r\n7400\t-5209\t2811\t3842\t2881",
				"6590\t-7359\t4151\t4062\t4870\r\n-4560\t-3225\t1872\t8386\t-9683\r\n7877\t-3774\t8833\t-8225\t-1419\r\n-1797\t-7382\t-6034\t8574\t-259\r\n-509\t2050\t-1367\t7482\t-3511\r\n6928\t2893\t7457\t-8529\t-8890\r\n5483\t8730\t253\t4472\t-4973\r\n-9351\t-4337\t7020\t7965\t820\r\n4184\t550\t6186\t-5470\t-6461\r\n8442\t-4881\t-3636\t-8961\t-1093\r\n-6701\t3232\t7894\t8589\t1358\r\n7400\t-5209\t2811\t3842\t2881\r\n-8152\t7335\t-4390\t3375\t-2149\r\n2516\t-6675\t-3236\t-7597\t7676\r\n-5293\t-6136\t1985\t4646\t577\r\n-7876\t-9100\t9753\t-583\t-6242",
				"6590\t-7359\t4151\t4062\t4870\r\n-4560\t-3225\t1872\t8386\t-9683\r\n7877\t-3774\t8833\t-8225\t-1419\r\n-1797\t-7382\t-6034\t8574\t-259\r\n-509\t2050\t-1367\t7482\t-3511\r\n6928\t2893\t7457\t-8529\t-8890\r\n5483\t8730\t253\t4472\t-4973\r\n-9351\t-4337\t7020\t7965\t820\r\n4184\t550\t6186\t-5470\t-6461\r\n8442\t-4881\t-3636\t-8961\t-1093\r\n-6701\t3232\t7894\t8589\t1358\r\n7400\t-5209\t2811\t3842\t2881\r\n-8152\t7335\t-4390\t3375\t-2149\r\n2516\t-6675\t-3236\t-7597\t7676\r\n-5293\t-6136\t1985\t4646\t577\r\n-7876\t-9100\t9753\t-583\t-6242\r\n-5519\t-4134\t8627\t-5855\t3506\r\n7983\t-7173\t6870\t7602\t1974\r\n9397\t-6181\t-9857\t1166\t4290\r\n5467\t7906\t-5774\t-3815\t-707");

			new SearchUnit().Test("Пошук вузла", path, 8833, 8833, 8833, 9753, 9753);

			new MaxUnit().Test("Пошук найбільшого числа", path, 0, 1, 2, 3, 4);

			new LineUnit().Test("Створення дерева з символів", path,
				"ABCDEFGABC",
				"ABCDEFGABCabcdefgfh",
				"DEFGABCabcdefghklopqrklmnopqr",
				"JKLMNOPBDFGABCcdefgfghklmnopqrklmqr",
				"JKLMNOPABCDEFGABCabcdefgfghklmnopqrklmnopqrXV");

			new DublicatesUnit().Test("Видалення символів, що повторюються", path, 0, 1, 2, 3, 4);

			var source = @"D:\Документи\Навчання\ІФНТУНГ\2 Курс\1 Семестр\Алгоритми та структури даних\Лабраторні\Лабораторна 5 -\";

			new DocumentUnit().Test("Створення дерева зі слів", path,
				source + "100 слів.txt", source + "200 слів.txt", source + "300 слів.txt",
				source + "400 слів.txt", source + "500 слів.txt");

			new DeletionUnit().Test("Видалення слів, що починаються на літеру", path,
				'с', 'с', 'с', 'с', 'с');

			new LayoutUnit().Test("Зміна розкладки", path,
				"qwert", "asdfghjkl;", "213lkjhdfghp[]", "][jkcvfgdl;jqrvb8710", "HJFcnehv_c=1456ldu fdtn");
		}
	}
}